In [3]:
import numpy as np
import pandas as pd
np.ones((5,5))

array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]])

In [4]:
arr1 = np.random.rand(5)
arr1

array([0.13752497, 0.84467994, 0.49501209, 0.76093837, 0.11414688])

In [5]:
arr2 = np.random.rand(5,5)
arr2

array([[0.97691748, 0.02661796, 0.30121211, 0.33337772, 0.82815281],
       [0.45684553, 0.54894571, 0.67310473, 0.64025242, 0.49426965],
       [0.16213293, 0.36997791, 0.76166939, 0.5230717 , 0.48290626],
       [0.87045843, 0.12568803, 0.5564135 , 0.41640581, 0.97433162],
       [0.08006325, 0.68216092, 0.3046021 , 0.46245939, 0.90031736]])

In [15]:
arr3=[[1,2,3],[4,5,6]]
arr3=np.array(arr3)
arr3

array([[1, 2, 3],
       [4, 5, 6]])

In [17]:
arr3[:,1:]

array([[2, 3],
       [5, 6]])

In [18]:
arr2d=np.zeros((10,10))
arr2d

array([[0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.]])

In [24]:
arr2d.shape[0]

10

In [25]:
for i in range(arr2d.shape[0]):
    arr2d[i] = i

In [26]:
arr2d

array([[0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [2., 2., 2., 2., 2., 2., 2., 2., 2., 2.],
       [3., 3., 3., 3., 3., 3., 3., 3., 3., 3.],
       [4., 4., 4., 4., 4., 4., 4., 4., 4., 4.],
       [5., 5., 5., 5., 5., 5., 5., 5., 5., 5.],
       [6., 6., 6., 6., 6., 6., 6., 6., 6., 6.],
       [7., 7., 7., 7., 7., 7., 7., 7., 7., 7.],
       [8., 8., 8., 8., 8., 8., 8., 8., 8., 8.],
       [9., 9., 9., 9., 9., 9., 9., 9., 9., 9.]])

In [27]:
arr=np.arange(1,11)

In [28]:
arr

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [29]:
arr[arr>4]

array([ 5,  6,  7,  8,  9, 10])

In [30]:
arr_3=[[1,2,3],[4,5,6]]
arr_3=np.array(arr_3)

In [31]:
arr_3

array([[1, 2, 3],
       [4, 5, 6]])

In [35]:
arr_4=[[1,2,3],[4,5,6]]
arr_4=np.array(arr_4)
arr_4

array([[1, 2, 3],
       [4, 5, 6]])

In [37]:
arr_new = arr_3 * arr_4

In [38]:
arr_new

array([[ 1,  4,  9],
       [16, 25, 36]])

In [46]:
arr_uni = np.array([1,2,3])
arr_rd= arr_uni ** 0.5
arr_rd.round()

array([1., 1., 2.])

In [47]:
import pandas as pd

In [48]:
labels=['a','b','c']
nums=[10,20,30]
arr=np.array(nums)

In [49]:
pd.Series(nums,labels)

a    10
b    20
c    30
dtype: int64

In [4]:
df = pd.DataFrame(np.random.randn(5,4), index = ['A','B','C','D','E'], columns = ['F','G','H','I'])

In [7]:
len(df.index)

5

In [57]:
df[['F','G']]

          F         G
A -0.432445  1.361288
B  1.512520 -1.349208
C  1.561079 -2.015096
D  0.099812  0.361533
E -0.768539  1.132196

In [58]:
df['new'] = pd.Series({'A':10,'B':20,'C':30,'D':40,'E':50})
df

          F         G         H         I  new
A -0.432445  1.361288 -0.816364  2.299188   10
B  1.512520 -1.349208  0.968564 -0.857801   20
C  1.561079 -2.015096 -1.544963 -0.186756   30
D  0.099812  0.361533  1.938622  1.026078   40
E -0.768539  1.132196  0.525633 -1.973447   50

In [10]:
df.drop('A', axis = 0)
len(df.columns)

4

In [60]:
df # So the above deletion was not permanent. For it to become permanent, we have to include inplace = True after axis

          F         G         H         I  new
A -0.432445  1.361288 -0.816364  2.299188   10
B  1.512520 -1.349208  0.968564 -0.857801   20
C  1.561079 -2.015096 -1.544963 -0.186756   30
D  0.099812  0.361533  1.938622  1.026078   40
E -0.768539  1.132196  0.525633 -1.973447   50

In [62]:
df.loc['B']

F       1.512520
G      -1.349208
H       0.968564
I      -0.857801
new    20.000000
Name: B, dtype: float64

In [64]:
df.iloc[1]

F       1.512520
G      -1.349208
H       0.968564
I      -0.857801
new    20.000000
Name: B, dtype: float64

In [65]:
df.loc[['B','C']]

          F         G         H         I  new
B  1.512520 -1.349208  0.968564 -0.857801   20
C  1.561079 -2.015096 -1.544963 -0.186756   30

In [66]:
df.loc[['B','C'],['F','G']]

          F         G
B  1.512520 -1.349208
C  1.561079 -2.015096

In [68]:
df > 0

       F      G      H      I   new
A  False   True  False   True  True
B   True  False   True  False  True
C   True  False  False  False  True
D   True   True   True   True  True
E  False   True   True  False  True

In [69]:
df[df>0]

          F         G         H         I  new
A       NaN  1.361288       NaN  2.299188   10
B  1.512520       NaN  0.968564       NaN   20
C  1.561079       NaN       NaN       NaN   30
D  0.099812  0.361533  1.938622  1.026078   40
E       NaN  1.132196  0.525633       NaN   50

In [70]:
df[df['G']>0]['G']

A    1.361288
D    0.361533
E    1.132196
Name: G, dtype: float64

In [78]:
df.reset_index()

  index         F         G         H         I  new
0     A -0.432445  1.361288 -0.816364  2.299188   10
1     B  1.512520 -1.349208  0.968564 -0.857801   20
2     C  1.561079 -2.015096 -1.544963 -0.186756   30
3     D  0.099812  0.361533  1.938622  1.026078   40
4     E -0.768539  1.132196  0.525633 -1.973447   50

In [74]:
df.sort_values(by='F')

          F         G         H         I  new
E -0.768539  1.132196  0.525633 -1.973447   50
A -0.432445  1.361288 -0.816364  2.299188   10
D  0.099812  0.361533  1.938622  1.026078   40
B  1.512520 -1.349208  0.968564 -0.857801   20
C  1.561079 -2.015096 -1.544963 -0.186756   30

In [75]:
df.isnull()

       F      G      H      I    new
A  False  False  False  False  False
B  False  False  False  False  False
C  False  False  False  False  False
D  False  False  False  False  False
E  False  False  False  False  False